#+title: Test

#+BEGIN_SRC sh :results output
dig up.edu.mx
#+END_SRC

#+RESULTS:
#+begin_example
; <<>> DiG 9.20.17 <<>> up.edu.mx
;; global options: +cmd
;; Got answer:
;; ->>HEADER<<- opcode: QUERY, status: NOERROR, id: 48490
;; flags: qr rd ra; QUERY: 1, ANSWER: 1, AUTHORITY: 0, ADDITIONAL: 1

;; OPT PSEUDOSECTION:
; EDNS: version: 0, flags:; udp: 512
;; QUESTION SECTION:
;up.edu.mx.			IN	A

;; ANSWER SECTION:
up.edu.mx.		1386	IN	A	20.65.99.202

;; Query time: 4 msec
;; SERVER: 192.168.1.254#53(192.168.1.254) (UDP)
;; WHEN: Wed Jan 07 15:42:48 CST 2026
;; MSG SIZE  rcvd: 54
#+end_example
